ntdll!_ETHREAD
   +0x000 Tcb              : _KTHREAD
   +0x5f0 CreateTime       : _LARGE_INTEGER
   +0x5f8 ExitTime         : _LARGE_INTEGER
   +0x5f8 KeyedWaitChain   : _LIST_ENTRY
   +0x608 PostBlockList    : _LIST_ENTRY
   +0x608 ForwardLinkShadow : Ptr64 Void
   +0x610 StartAddress     : Ptr64 Void
   +0x618 TerminationPort  : Ptr64 _TERMINATION_PORT
   +0x618 ReaperLink       : Ptr64 _ETHREAD
   +0x618 KeyedWaitValue   : Ptr64 Void
   +0x620 ActiveTimerListLock : Uint8B
   +0x628 ActiveTimerListHead : _LIST_ENTRY
   +0x638 Cid              : _CLIENT_ID
   +0x648 KeyedWaitSemaphore : _KSEMAPHORE
   +0x648 AlpcWaitSemaphore : _KSEMAPHORE
   +0x668 ClientSecurity   : _PS_CLIENT_SECURITY_CONTEXT
   +0x670 IrpList          : _LIST_ENTRY
   +0x680 TopLevelIrp      : Uint8B
   +0x688 DeviceToVerify   : Ptr64 _DEVICE_OBJECT
   +0x690 Win32StartAddress : Ptr64 Void
   +0x698 ChargeOnlySession : Ptr64 Void
   +0x6a0 LegacyPowerObject : Ptr64 Void
   +0x6a8 ThreadListEntry  : _LIST_ENTRY
   +0x6b8 RundownProtect   : _EX_RUNDOWN_REF
   +0x6c0 ThreadLock       : _EX_PUSH_LOCK
   +0x6c8 ReadClusterSize  : Uint4B
   +0x6cc MmLockOrdering   : Int4B
   +0x6d0 CrossThreadFlags : Uint4B
   +0x6d0 Terminated       : Pos 0, 1 Bit
   +0x6d0 ThreadInserted   : Pos 1, 1 Bit
   +0x6d0 HideFromDebugger : Pos 2, 1 Bit
   +0x6d0 ActiveImpersonationInfo : Pos 3, 1 Bit
   +0x6d0 HardErrorsAreDisabled : Pos 4, 1 Bit
   +0x6d0 BreakOnTermination : Pos 5, 1 Bit
   +0x6d0 SkipCreationMsg  : Pos 6, 1 Bit
   +0x6d0 SkipTerminationMsg : Pos 7, 1 Bit
   +0x6d0 CopyTokenOnOpen  : Pos 8, 1 Bit
   +0x6d0 ThreadIoPriority : Pos 9, 3 Bits
   +0x6d0 ThreadPagePriority : Pos 12, 3 Bits
   +0x6d0 RundownFail      : Pos 15, 1 Bit
   +0x6d0 UmsForceQueueTermination : Pos 16, 1 Bit
   +0x6d0 IndirectCpuSets  : Pos 17, 1 Bit
   +0x6d0 DisableDynamicCodeOptOut : Pos 18, 1 Bit
   +0x6d0 ExplicitCaseSensitivity : Pos 19, 1 Bit
   +0x6d0 PicoNotifyExit   : Pos 20, 1 Bit
   +0x6d0 DbgWerUserReportActive : Pos 21, 1 Bit
   +0x6d0 ForcedSelfTrimActive : Pos 22, 1 Bit
   +0x6d0 SamplingCoverage : Pos 23, 1 Bit
   +0x6d0 ReservedCrossThreadFlags : Pos 24, 8 Bits
   +0x6d4 SameThreadPassiveFlags : Uint4B
   +0x6d4 ActiveExWorker   : Pos 0, 1 Bit
   +0x6d4 MemoryMaker      : Pos 1, 1 Bit
   +0x6d4 StoreLockThread  : Pos 2, 2 Bits
   +0x6d4 ClonedThread     : Pos 4, 1 Bit
   +0x6d4 KeyedEventInUse  : Pos 5, 1 Bit
   +0x6d4 SelfTerminate    : Pos 6, 1 Bit
   +0x6d4 RespectIoPriority : Pos 7, 1 Bit
   +0x6d4 ActivePageLists  : Pos 8, 1 Bit
   +0x6d4 SecureContext    : Pos 9, 1 Bit
   +0x6d4 ZeroPageThread   : Pos 10, 1 Bit
   +0x6d4 ReservedSameThreadPassiveFlags : Pos 11, 21 Bits
   +0x6d8 SameThreadApcFlags : Uint4B
   +0x6d8 OwnsProcessAddressSpaceExclusive : Pos 0, 1 Bit
   +0x6d8 OwnsProcessAddressSpaceShared : Pos 1, 1 Bit
   +0x6d8 HardFaultBehavior : Pos 2, 1 Bit
   +0x6d8 StartAddressInvalid : Pos 3, 1 Bit
   +0x6d8 EtwCalloutActive : Pos 4, 1 Bit
   +0x6d8 SuppressSymbolLoad : Pos 5, 1 Bit
   +0x6d8 Prefetching      : Pos 6, 1 Bit
   +0x6d8 OwnsVadExclusive : Pos 7, 1 Bit
   +0x6d9 SystemPagePriorityActive : Pos 0, 1 Bit
   +0x6d9 SystemPagePriority : Pos 1, 3 Bits
   +0x6d9 AllowWritesToExecutableMemory : Pos 4, 1 Bit
   +0x6dc CacheManagerActive : UChar
   +0x6dd DisablePageFaultClustering : UChar
   +0x6de ActiveFaultCount : UChar
   +0x6df LockOrderState   : UChar
   +0x6e0 AlpcMessageId    : Uint8B
   +0x6e8 AlpcMessage      : Ptr64 Void
   +0x6e8 AlpcReceiveAttributeSet : Uint4B
   +0x6f0 AlpcWaitListEntry : _LIST_ENTRY
   +0x700 ExitStatus       : Int4B
   +0x704 CacheManagerCount : Uint4B
   +0x708 IoBoostCount     : Uint4B
   +0x70c IoQoSBoostCount  : Uint4B
   +0x710 IoQoSThrottleCount : Uint4B
   +0x718 BoostList        : _LIST_ENTRY
   +0x728 DeboostList      : _LIST_ENTRY
   +0x738 BoostListLock    : Uint8B
   +0x740 IrpListLock      : Uint8B
   +0x748 ReservedForSynchTracking : Ptr64 Void
   +0x750 CmCallbackListHead : _SINGLE_LIST_ENTRY
   +0x758 ActivityId       : Ptr64 _GUID
   +0x760 SeLearningModeListHead : _SINGLE_LIST_ENTRY
   +0x768 VerifierContext  : Ptr64 Void
   +0x770 KernelStackReference : Uint4B
   +0x778 AdjustedClientToken : Ptr64 Void
   +0x780 WorkOnBehalfThread : Ptr64 Void
   +0x788 PropertySet      : _PS_PROPERTY_SET
   +0x7a0 PicoContext      : Ptr64 Void
   +0x7a8 UserFsBase       : Uint8B
   +0x7b0 UserGsBase       : Uint8B
   +0x7b8 EnergyValues     : Ptr64 _THREAD_ENERGY_VALUES
   +0x7c0 CmDbgInfo        : Ptr64 Void
   +0x7c8 SelectedCpuSets  : Uint8B
   +0x7c8 SelectedCpuSetsIndirect : Ptr64 Uint8B
   +0x7d0 Silo             : Ptr64 _EJOB
   +0x7d8 ThreadName       : Ptr64 _UNICODE_STRING
   +0x7e0 SetContextState  : Ptr64 _CONTEXT
   +0x7e8 LastExpectedRunTime : Uint4B
   +0x7f0 OwnerEntryListHead : _LIST_ENTRY
   +0x800 DisownedOwnerEntryListLock : Uint8B
   +0x808 DisownedOwnerEntryListHead : _LIST_ENTRY